Autodesk.Revit.DB.FabricationItemFolder.UpdateItemFiles
Since:
2019

Autodesk.Revit.DB.FabricationItemFolder.UpdateSubFolders
Since:
2019

Autodesk.Revit.DB.FabricationItemFolder.GUID
The item folder's globally unique identifier.
Since:
2019